In [2]:
import numpy as np
import pandas as pd

In [3]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

Working with dates

In [8]:
date['date'] = pd.to_datetime(date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [22]:
#Extract year
date['date_year'] = date['date'].dt.year
date['date_month'] = date['date'].dt.month
date['date_month_name'] = date['date'].dt.month_name()
date['date_day'] = date['date'].dt.day
date['date_day_name'] = date['date'].dt.day_name()
date['date_dow'] = date['date'].dt.dayofweek
date['date_week'] = date['date'].dt.week
date['date_quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id', 'city_id', 'orders']).head()
date.sample(5)

<ipython-input-22-45989c736194>:8: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow,date_day_name,date_is_weekend,date_week,date_quarter
535,2019-10-26,7318,25,1,2019,10,October,26,5,Saturday,1,43,4
667,2018-10-18,687,14,1,2018,10,October,18,3,Thursday,0,42,4
848,2019-07-11,3524,25,99,2019,7,July,11,3,Thursday,0,28,3
741,2019-11-10,7318,25,1,2019,11,November,10,6,Sunday,1,45,4
62,2019-01-13,5033,25,1,2019,1,January,13,6,Sunday,1,2,1

In [20]:
#is weekend

date['date_is_weekend'] = np.where(date['date_day_name'].isin(['Sunday','Saturday']),1,0)

In [25]:
date['semester'] = np.where(date['date_quarter'].isin([1,2]),1,2)
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow,date_day_name,date_is_weekend,date_week,date_quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1,1

Time

In [26]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2022, 12, 22, 19, 30, 40, 244354)

In [27]:
today - date['date']

0     1108 days 19:30:40.244354
1     1590 days 19:30:40.244354
2     1521 days 19:30:40.244354
3     1223 days 19:30:40.244354
4     1446 days 19:30:40.244354
                 ...
995   1536 days 19:30:40.244354
996   1477 days 19:30:40.244354
997   1325 days 19:30:40.244354
998   1390 days 19:30:40.244354
999   1164 days 19:30:40.244354
Name: date, Length: 1000, dtype: timedelta64[ns]

In [28]:
(today - date['date']).dt.days

0      1108
1      1590
2      1521
3      1223
4      1446
       ...
995    1536
996    1477
997    1325
998    1390
999    1164
Name: date, Length: 1000, dtype: int64

In [29]:
#Months passed
np.round((today - date['date'])/ np.timedelta64(1, 'M'),0)

0      36.0
1      52.0
2      50.0
3      40.0
4      48.0
       ...
995    50.0
996    49.0
997    44.0
998    46.0
999    38.0
Name: date, Length: 1000, dtype: float64

In [ ]:
#Time 
 time.info()